openFoam-cases/nonRefined_back_AFC/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


application         pimpleFoam;

startFrom           latestTime;

startTime           0.0;

stopAt              endTime;

endTime             100.0;

deltaT              0.005;

writeControl        runTime;

writeInterval       0.5;

purgeWrite          0;

writeFormat         ascii;

writePrecision      8;

writeCompression    off;

timeFormat          general;

timePrecision       12;

runTimeModifiable   true;

adjustTimeStep      true;

maxCo               0.5;

maxDeltaT           1;

functions
{

}

// ************************************************************************* //
