openFoam-cases/nonRefined_back_AFC/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

7
(
    inlet
    {
        type            patch;
        nFaces          72;
        startFace       31896;
    }
    outlet
    {
        type            patch;
        nFaces          72;
        startFace       31968;
    }
    wall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          58;
        startFace       32040;
    }
    lower
    {
        type            symmetry;
        inGroups        1(symmetry);
        nFaces          210;
        startFace       32098;
    }
    upper
    {
        type            symmetry;
        inGroups        1(symmetry);
        nFaces          210;
        startFace       32308;
    }
    AFC
    {
        type            patch;
        nFaces          2;
        startFace       32518;
    }
    defaultFaces
    {
        type            empty;
        inGroups        1(empty);
        nFaces          32208;
        startFace       32520;
    }
)

// ************************************************************************* //
